openfoam_template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  Moth hull — background mesh for interFoam (two-phase free surface)
  Domain (metres): x[-1,5]  y[-1.5,1.5]  z[-0.8,0.5]
  z=0 = calm waterline,  z<0 = water,  z>0 = air
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-1.0  -1.5  -0.8)   // 0
    ( 5.0  -1.5  -0.8)   // 1
    ( 5.0   1.5  -0.8)   // 2
    (-1.0   1.5  -0.8)   // 3
    (-1.0  -1.5   0.5)   // 4
    ( 5.0  -1.5   0.5)   // 5
    ( 5.0   1.5   0.5)   // 6
    (-1.0   1.5   0.5)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (36 18 13) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces ( (0 4 7 3) );
    }
    outlet
    {
        type patch;
        faces ( (1 2 6 5) );
    }
    front
    {
        type wall;
        faces ( (0 1 5 4) );
    }
    back
    {
        type wall;
        faces ( (2 3 7 6) );
    }
    bottom
    {
        type wall;
        faces ( (0 3 2 1) );
    }
    atmosphere
    {
        type patch;
        faces ( (4 5 6 7) );
    }
);
