openfoam_template/0/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

// p_rgh = p - rho*g*h  (modified pressure)
dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    inlet        { type fixedFluxPressure; value uniform 0; }
    outlet       { type fixedValue;        value uniform 0; }
    hull         { type fixedFluxPressure; value uniform 0; }
    front        { type fixedFluxPressure; value uniform 0; }
    back         { type fixedFluxPressure; value uniform 0; }
    bottom       { type fixedFluxPressure; value uniform 0; }
    atmosphere   { type totalPressure;     p0 uniform 0; value uniform 0; }
}
