openfoam_template/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.00135;

boundaryField
{
    inlet        { type fixedValue;       value uniform 0.00135; }
    outlet       { type zeroGradient; }
    hull         { type kqRWallFunction;  value uniform 0.00135; }
    front        { type kqRWallFunction;  value uniform 0.00135; }
    back         { type kqRWallFunction;  value uniform 0.00135; }
    bottom       { type kqRWallFunction;  value uniform 0.00135; }
    atmosphere   { type inletOutlet;      inletValue uniform 0.00135; value uniform 0.00135; }
}
