openfoam_template/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 4.2e-4;

boundaryField
{
    inlet        { type calculated;        value uniform 4.2e-4; }
    outlet       { type calculated;        value uniform 4.2e-4; }
    hull         { type nutkWallFunction;  value uniform 4.2e-4; }
    front        { type nutkWallFunction;  value uniform 4.2e-4; }
    back         { type nutkWallFunction;  value uniform 4.2e-4; }
    bottom       { type nutkWallFunction;  value uniform 4.2e-4; }
    atmosphere   { type calculated;        value uniform 4.2e-4; }
}
