openfoam_template/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr          2;
        nAlphaSubCycles     1;
        cAlpha              1;
        icAlpha             0;
        MULESCorr           yes;
        nLimiterIter        3;
        solver              smoothSolver;
        smoother            symGaussSeidel;
        tolerance           1e-8;
        relTol              0;
    }

    "pcorr.*"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-5;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.05;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    "(k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    kFinal
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    omegaFinal
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    1;
    nCorrectors         3;
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
    fields      { p_rgh 0.7; }
    equations   { U 0.7; k 0.5; omega 0.5; }
}
