openfoam_template/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains  16;   // set to number of CPU cores you want to use
method              scotch;
