openfoam_template/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

// Initialise alpha.water: 1 (water) below z=0, 0 (air) above
defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
        box (-2 -2 -1.0) (6 2 0.0);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
);
